app/controllers/api/v1/musics_controller.rb

      def index
        musics = Music.all
---
SELECT "musics".* FROM "musics"

      def show
        music = Music.find(params[:id])

        if music.ratings.blank?
          average_rating = 0
        else
          average_rating = music.ratings.average(:value).round(1)
---
SELECT "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."music_id" = ?  [["music_id", 1]]
SELECT AVG("ratings"."value") FROM "ratings" WHERE "ratings"."music_id" = ?  [["music_id", 1]]

      def create
        music = Music.new(music_params)
        music.save!
---
INSERT INTO "musics" ("title", "description", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Go Like"], ["description", "Amazing music by Fox Stevenson"], ["photo", nil], ["created_at", "2022-04-16 22:59:40.879032"], ["updated_at", "2022-04-16 22:59:40.879032"]]

      def update
        music = Music.find(params[:id])
        music.update!(music_params)
---
SELECT "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "musics" SET "title" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["title", "Crossfire Remix"], ["updated_at", "2022-04-16 23:24:19.361382"], ["id", 1]]

      def delete
        music = Music.find(params[:id])
        music.destroy!
---
SELECT "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 1]]