app/controllers/api/v1/ratings_controller.rb

      def create
        rating = Rating.new(rating_params)
        rating.save!
---
INSERT INTO "ratings" ("value", "user_id", "created_at", "updated_at", "music_id") VALUES (?, ?, ?, ?, ?)  [["value", 2], ["user_id", 1], ["created_at", "2022-04-22 12:18:37.501438"], ["updated_at", "2022-04-22 12:18:37.501438"], ["music_id", 1]]