app/controllers/api/v1/users_controller.rb

      def login
        user = User.find_by!(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "chevroleide@mas"], ["LIMIT", 1]]

      def logout
        current_user.update! authentication_token: nil
---
UPDATE "users" SET "updated_at" = ?, "authentication_token" = ? WHERE "users"."id" = ?  [["updated_at", "2022-04-13 14:36:27.018940"], ["authentication_token", "XhvxqXmkxS6J2sajaoWJ"], ["id", 1]]

      def create
        user = User.new(user_params)
        user.save!
---
INSERT INTO "users" ("email", "encrypted_password", "name", "is_admin", "created_at", "updated_at", "authentication_token") VALUES (?, ?, ?, ?, ?, ?, ?)